In [1]:
import os
from datetime import datetime, timedelta
from scipy import stats
import pandas as pd

In [2]:
def read_database(file_name):
    return pd.read_csv(file_name)

In [65]:
df_sales = read_database('2022-04-01T12_df_sales.csv')
df_sales['date'] = pd.to_datetime(df_sales['date'])

In [66]:
df_sales.head(2)

   sale_id                date  count_pizza  count_drink  price user_id
0  1000001 2022-02-04 10:00:24            1            0    720  1c1543
1  1000002 2022-02-04 10:02:28            1            1    930  a9a6e8

In [69]:
df_sales2 = df_sales.groupby(['user_id']).sale_id.count()
df_sales2.columns = ['user_id', 'count']
df_sales2.head(2)

user_id
000096    2
0000d4    2
Name: sale_id, dtype: int64

In [76]:
mask = df_sales2>1
df=df_sales[df_sales['user_id'].isin(df_sales2.loc[mask].index)].sort_values(by=['user_id','date'])
df.head(5)

        sale_id                date  count_pizza  count_drink  price user_id
101925  1101926 2022-03-04 11:15:55            1            0    720  000096
168536  1168537 2022-03-22 13:16:09            1            0    720  000096
90423   1090424 2022-02-28 16:32:09            1            0    720  0000d4
186586  1186587 2022-03-27 11:26:30            1            1    720  0000d4
28831   1028832 2022-02-11 18:57:15            1            1    660  0000de

In [79]:
df['time_diff'] = df.groupby('user_id')['date'].diff()
df.head()

,sale_id,date,count_pizza,count_drink,price,user_id,time_diff
101925,1101926,2022-03-04 11:15:55,1,0,720,000096,NaT
168536,1168537,2022-03-22 13:16:09,1,0,720,000096,18 days 02:00:14
90423,1090424,2022-02-28 16:32:09,1,0,720,0000d4,NaT
186586,1186587,2022-03-27 11:26:30,1,1,720,0000d4,26 days 18:54:21
28831,1028832,2022-02-11 18:57:15,1,1,660,0000de,NaT

In [87]:
mask = df['time_diff'].notna()
df['time_diff'].loc[mask].mean()

Timedelta('17 days 07:37:57.653431857')